
enemy_prefix = {
	-- 名字,  挑战等级增加, 经验百分比, hp百分比, mp百分比, 伤害百分比, 防御百分比, 护甲百分比, 抗性百分比, 技能列表增加
	{'坚韧',             1,       1.2,       1.5,        1,          1,        1.3,        1.3,        1.3,           {}}, -- 1
}

enemy_template = {
	-- 名字, 挑战等级增加, 经验百分比, hp百分比, mp百分比, 伤害百分比, 防御百分比, 护甲百分比, 抗性百分比, 技能列表增加
	{'普通',           0,          1,        1,        1,          1,         1,           1,          1,          {}}, -- 1
	{'精英',           1,       1.25,     1.25,     1.25,       1.15,      1.10,        1.10,       1.10,          {}}, -- 2
	{'英雄',           2,       1.50,     1.35,     1.35,       1.30,      1.20,        1.20,       1.20,          {}}, -- 3
	{'首领',           3,       1.75,     1.45,     1.45,       1.45,      1.30,        1.30,       1.30,          {}}, -- 4
	{'特殊',           3,       4.15,        1,        1,          1,         1,           1,          1,          {}}, -- 5
}

templ_set = {
	newbie = {{0.85, 0.15}, {enemy_template[1], enemy_template[2]}},
}

-- 攻击类型：1近战，2远程，3魔法

enemy = {
	--名字, 挑战等级,    HP,     MP,  攻击类型, 最小伤害, 最大伤害, 防御, 护甲, 抗性, 防御, 前缀集合,           模板集合, 技能列表, 说明
	{'碧油鸡',     1,   225,    225,         1,         4,       6,   12,    8,   10,   12,       {},   templ_set.newbie,       {}, '一只绿油油的鸡，总在隐蔽的地方出现。但有时也在大庭广众之下游荡'}, -- 1
}

enemy_set = {
	newbie = {1},
}
